controllers/SiteController.php

    public function actionIndex()
    {
		$query = Users::find();
 		$model = new SearchForm();
		$searchQuery = '';

        if ($model->load(Yii::$app->request->post()) && !empty($_POST['SearchForm']['search'])) {

 			$users = $query->select(['*'])
				->from('users')
				->where(['like', 'fio', $_POST['SearchForm']['search']])
				->all();

			$pagination = new Pagination([
				'defaultPageSize' => 10,
				'totalCount' => count($users),
			]);

			$searchQuery = $_POST['SearchForm']['search'];

        }else{
			$pagination = new Pagination([
				'defaultPageSize' => 10,
				'totalCount' => $query->count(),
			]);

			$users = $query->orderBy('id')
				->offset($pagination->offset)
				->limit($pagination->limit)
				->all();
---
SELECT * FROM `users` WHERE `fio` LIKE '%мих%'
SELECT COUNT(*) FROM `users`
SELECT * FROM `users` ORDER BY `id` LIMIT 10 OFFSET 10