models/User.php

SELECT * FROM `users` ORDER BY `id`
---
    public static function initial(){
		$query = Users::find();
		$users = $query->orderBy('id')->all();